#+TITLE: Doom Config

#+BEGIN_SRC emacs-lisp
(setenv "PATH" (concat (getenv "PATH") ":/opt/texlive/2022/bin/x86_64-linux/"))
#+END_SRC

** Web

#+BEGIN_SRC emacs-lisp
;(after! web-mode
  (add-to-list 'auto-mode-alist '("\\.tag\\'" . web-mode))
  (setq web-mode-engines-alist
        '(("riot" . "\\.tag\\'")))
;;)
#+END_SRC

#+RESULTS:
: ((riot . \.tag\'))

** Default Font

Set default font

#+BEGIN_SRC emacs-lisp
;; ;; Why not like this?
;; (set-face-attribute 'default nil
;;                     :height 120
;;                     :family "Iosevka Nerd Font Mono")

(setq doom-font-increment 1)
(setq doom-font (font-spec
                 :family "Iosevka Slab"
                 ; :family "DejaVu Sans Mono"
                 :size 22
                 :weight 'normal)
      ;; inherits `doom-font''s :size
      doom-variable-pitch-font (font-spec :family "Iosevka Slab")
      doom-unicode-font (font-spec :family "Iosevka Slab" :size 22)
      doom-big-font (font-spec :family "Iosevka Slab" :size 24))
#+END_SRC

#+RESULTS:
: #<font-spec nil nil Iosevka\ Slab nil nil nil nil nil 24 nil nil nil nil>

Change font on the fly.

#+BEGIN_SRC emacs-lisp
(setq ph/font-list
      '("Iosevka Slab"))

(defun ph/doom-set-font (font)
  (message (concat "setting font to " font))
  (setq doom-font (font-spec :family font))
  (doom/reload-font))

(defun ph/doom-next-font ()
  "Load next theme."
  (interactive)
  (setq ph/font-list
        (ph/call-rotate 'ph/doom-set-font ph/font-list)))
#+END_SRC

#+RESULTS:
: ph/doom-next-font

** Modeline

#+BEGIN_SRC emacs-lisp
(after! doom-modeline
  (setq doom-modeline-icon nil)
  (setq doom-modeline-percent-position nil)
  (setq doom-modeline-height 24)
  (setq doom-modeline-checker-simple-format nil)
  (setq doom-modeline-minor-modes nil)
  (setq doom-modeline-vcs-max-length 24)
  (setq doom-modeline-buffer-file-name-style 'buffer-name)
  )
#+END_SRC

#+BEGIN_SRC emacs-lisp
(after! doom-modeline
(doom-modeline-def-segment ph/projectile-project-name
  (when (projectile-project-p)
    (concat
     (doom-modeline-spc)
     (propertize (projectile-project-name) 'face
                 (if (doom-modeline--active)
                     'doom-modeline-buffer-path
                   'mode-line-inactive))
     (doom-modeline-spc))))
  )
#+END_SRC

#+BEGIN_SRC emacs-lisp
(after! doom-modeline
(setq doom-modeline-evil-state-faces-alist
      '((normal . doom-modeline-evil-normal-state)
        (emacs . doom-modeline-evil-emacs-state)
        (insert . doom-modeline-evil-insert-state)
        (motion . doom-modeline-evil-motion-state)
        (visual . doom-modeline-evil-visual-state)
        (operator . doom-modeline-evil-operator-state)
        (replace . doom-modeline-evil-replace-state)))

(doom-modeline-def-segment ph/evil-state
  "The current evil state. Requires `evil-mode' to be enabled."
  (when (bound-and-true-p evil-local-mode)
    (let ((tag (evil-state-property evil-state :tag t)))
      (propertize (if (stringp tag) tag (funcall tag)) 'face
                  (if (doom-modeline--active)
                      (cdr (assoc evil-state
                                  doom-modeline-evil-state-faces-alist))
                    'doom-modeline-bar-inactive)))))

(set-face-attribute 'doom-modeline-evil-emacs-state nil
                    :foreground "#111"
                    :background "#83a598")
(set-face-attribute 'doom-modeline-evil-insert-state nil
                    :foreground "#111"
                    :background "#b8bb26")
(set-face-attribute 'doom-modeline-evil-motion-state nil
                    :foreground "#111"
                    :background "#8ec07c")
(set-face-attribute 'doom-modeline-evil-normal-state nil
                    :foreground "#111"
                    :background "#fabd2f")
(set-face-attribute 'doom-modeline-evil-operator-state nil
                    :foreground "#111"
                    :background "#d5c4a1")
(set-face-attribute 'doom-modeline-evil-visual-state nil
                    :foreground "#111"
                    :background "#ebdbb2")
(set-face-attribute 'doom-modeline-evil-replace-state nil
                    :foreground "#111"
                    :background "#fb4934")
)
#+END_SRC

Setup modeline with my segments.

#+BEGIN_SRC emacs-lisp
(after! doom-modeline
  (doom-modeline-def-modeline 'main
  '(bar
    workspace-name
    window-number
    ph/evil-state
    ;; matches
    buffer-info
    remote-host
    buffer-position
    parrot
    selection-info
    ;tramp-method
    ;ph/buffer-info
    ;ph/flyspell-dictionary
    checker)
  '(minor-modes
    media-info
    misc-info
    vcs
    ph/projectile-project-name
    major-mode))

  ;; workaround for scaling problem
  (add-hook 'buffer-list-update-hook 'doom-modeline-refresh-font-width-cache))
#+END_SRC

#+RESULTS:
| doom-modeline-refresh-font-width-cache | flycheck-handle-buffer-switch | doom-run-switch-window-hooks-h | doom-modeline-window-size-change-function | doom-modeline-set-selected-window |

